ef15c/oberon_stm32f4/stm429_oberon_station/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdbool.h>
#include <string.h>
#include "stm32f4xx_it.h"
#include "raster.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define FB_SIZE (Span*768)
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
CRC_HandleTypeDef hcrc;

LTDC_HandleTypeDef hltdc;

SD_HandleTypeDef hsd;
DMA_HandleTypeDef hdma_sdio_rx;
DMA_HandleTypeDef hdma_sdio_tx;

SPI_HandleTypeDef hspi3;

UART_HandleTypeDef huart1;

DMA_HandleTypeDef hdma_memtomem_dma2_stream0;
SDRAM_HandleTypeDef hsdram1;

/* USER CODE BEGIN PV */

static FMC_SDRAM_CommandTypeDef Command;

static const uint32_t clut[256] = {
0X0,0X55,0XAA,0XFF,0X2400,0X2455,0X24AA,0X24FF,
0X4800,0X4855,0X48AA,0X48FF,0X6D00,0X6D55,0X6DAA,0X6DFF,
0X9100,0X9155,0X91AA,0X91FF,0XB600,0XB655,0XB6AA,0XB6FF,
0XDA00,0XDA55,0XDAAA,0XDAFF,0XFF00,0XFF55,0XFFAA,0XFFFF,
0X240000,0X240055,0X2400AA,0X2400FF,0X242400,0X242455,0X2424AA,0X2424FF,
0X244800,0X244855,0X2448AA,0X2448FF,0X246D00,0X246D55,0X246DAA,0X246DFF,
0X249100,0X249155,0X2491AA,0X2491FF,0X24B600,0X24B655,0X24B6AA,0X24B6FF,
0X24DA00,0X24DA55,0X24DAAA,0X24DAFF,0X24FF00,0X24FF55,0X24FFAA,0X24FFFF,
0X480000,0X480055,0X4800AA,0X4800FF,0X482400,0X482455,0X4824AA,0X4824FF,
0X484800,0X484855,0X4848AA,0X4848FF,0X486D00,0X486D55,0X486DAA,0X486DFF,
0X489100,0X489155,0X4891AA,0X4891FF,0X48B600,0X48B655,0X48B6AA,0X48B6FF,
0X48DA00,0X48DA55,0X48DAAA,0X48DAFF,0X48FF00,0X48FF55,0X48FFAA,0X48FFFF,
0X6D0000,0X6D0055,0X6D00AA,0X6D00FF,0X6D2400,0X6D2455,0X6D24AA,0X6D24FF,
0X6D4800,0X6D4855,0X6D48AA,0X6D48FF,0X6D6D00,0X6D6D55,0X6D6DAA,0X6D6DFF,
0X6D9100,0X6D9155,0X6D91AA,0X6D91FF,0X6DB600,0X6DB655,0X6DB6AA,0X6DB6FF,
0X6DDA00,0X6DDA55,0X6DDAAA,0X6DDAFF,0X6DFF00,0X6DFF55,0X6DFFAA,0X6DFFFF,
0X910000,0X910055,0X9100AA,0X9100FF,0X912400,0X912455,0X9124AA,0X9124FF,
0X914800,0X914855,0X9148AA,0X9148FF,0X916D00,0X916D55,0X916DAA,0X916DFF,
0X919100,0X919155,0X9191AA,0X9191FF,0X91B600,0X91B655,0X91B6AA,0X91B6FF,
0X91DA00,0X91DA55,0X91DAAA,0X91DAFF,0X91FF00,0X91FF55,0X91FFAA,0X91FFFF,
0XB60000,0XB60055,0XB600AA,0XB600FF,0XB62400,0XB62455,0XB624AA,0XB624FF,
0XB64800,0XB64855,0XB648AA,0XB648FF,0XB66D00,0XB66D55,0XB66DAA,0XB66DFF,
0XB69100,0XB69155,0XB691AA,0XB691FF,0XB6B600,0XB6B655,0XB6B6AA,0XB6B6FF,
0XB6DA00,0XB6DA55,0XB6DAAA,0XB6DAFF,0XB6FF00,0XB6FF55,0XB6FFAA,0XB6FFFF,
0XDA0000,0XDA0055,0XDA00AA,0XDA00FF,0XDA2400,0XDA2455,0XDA24AA,0XDA24FF,
0XDA4800,0XDA4855,0XDA48AA,0XDA48FF,0XDA6D00,0XDA6D55,0XDA6DAA,0XDA6DFF,
0XDA9100,0XDA9155,0XDA91AA,0XDA91FF,0XDAB600,0XDAB655,0XDAB6AA,0XDAB6FF,
0XDADA00,0XDADA55,0XDADAAA,0XDADAFF,0XDAFF00,0XDAFF55,0XDAFFAA,0XDAFFFF,
0XFF0000,0XFF0055,0XFF00AA,0XFF00FF,0XFF2400,0XFF2455,0XFF24AA,0XFF24FF,
0XFF4800,0XFF4855,0XFF48AA,0XFF48FF,0XFF6D00,0XFF6D55,0XFF6DAA,0XFF6DFF,
0XFF9100,0XFF9155,0XFF91AA,0XFF91FF,0XFFB600,0XFFB655,0XFFB6AA,0XFFB6FF,
0XFFDA00,0XFFDA55,0XFFDAAA,0XFFDAFF,0XFFFF00,0XFFFF55,0XFFFFAA,0XFFFFFF,
};

#if 0
static uint8_t *fb, *bb, *dmaBuf;
static size_t tranfSize;
static int color;
#endif

/* Si un jour j'arrive à intégrer le préchargement des modules en FLASH/SRAM */
/* space provision for Oberon modules static data
uint8_t modulesData[0x20000]; */
PS2_HandleTypeDef ps2_1;
PS2_HandleTypeDef ps2_2;
MSKBData mskbBlock;

volatile float a;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_FMC_Init(void);
static void MX_LTDC_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_SDIO_SD_Init(void);
static void MX_SPI3_Init(void);
static void MX_CRC_Init(void);
/* USER CODE BEGIN PFP */
static void BSP_PS2_Init(void);
#if 0
static void TransferComplete(DMA_HandleTypeDef *DmaHandle);
static void TransferError(DMA_HandleTypeDef *DmaHandle);
#endif
static void PS2_PINS_Output_OD_High(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void testTrap(uint32_t n);
void codeInRam(void);
void copyFunction(void);
static void MPU_RegionConfig(void);
void led(uint32_t l);
uint32_t ReadSD(uint32_t blockNum, uint8_t* dest, uint32_t nofBlocks);
#if 0
static void powerDown24(void);
static void stackOverflow(void);
#endif
void BootLoadM4(void);
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
SCB->SHCSR |= SCB_SHCSR_USGFAULTENA_Msk|SCB_SHCSR_BUSFAULTENA_Msk;
SCnSCB->ACTLR |= SCnSCB_ACTLR_DISMCYCINT_Msk;
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

