ef15c/oberon_stm32f4/stm429_oberon_station/Core/Src/main.c
  /* USER CODE BEGIN Init */
    a = 1.0; /*Contournement bug EMBitz quand PSP est utilisé*/
    a = a+2.0; /*Activate LSP */
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

    /* Enable microseconds delay via DWT */
    /* Disable TRC */
    CoreDebug->DEMCR &= ~CoreDebug_DEMCR_TRCENA_Msk; // ~0x01000000;
    /* Enable TRC */
    CoreDebug->DEMCR |=  CoreDebug_DEMCR_TRCENA_Msk; // 0x01000000;
    /* Disable clock cycle counter */
    DWT->CTRL &= ~DWT_CTRL_CYCCNTENA_Msk; //~0x00000001;
    /* Reset the clock cycle counter value */
    DWT->CYCCNT = 0;
    /* Enable  clock cycle counter */
    DWT->CTRL |=  DWT_CTRL_CYCCNTENA_Msk; //0x00000001;

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_FMC_Init();
  MX_LTDC_Init();
  MX_USART1_UART_Init();
  MX_SDIO_SD_Init();
  MX_SPI3_Init();
  MX_CRC_Init();
  /* USER CODE BEGIN 2 */
  PS2_PINS_Output_OD_High();
  BSP_PS2_Init();
  // COnfigure MPU to allow execution in range 0xD0201000 - 0xD0800000
  MPU_RegionConfig();
//#define NO_DMA

#if 0
  HAL_DMA_RegisterCallback(&hdma_memtomem_dma2_stream0, HAL_DMA_XFER_CPLT_CB_ID, TransferComplete);
  HAL_DMA_RegisterCallback(&hdma_memtomem_dma2_stream0, HAL_DMA_XFER_ERROR_CB_ID, TransferError);

  fb = (uint8_t *) 0xD0000000;
  bb = fb+FB_SIZE;
#ifndef VGA_DMA
  uint8_t *tmp = fb;
  uint32_t *tmp4 = (uint32_t *) fb;
#endif
  uint32_t n=0;

    for (n=0; n<FB_SIZE/4; n++) {
        *tmp4++ = 0;
    }

    // Draw cross
    // Hrozontal line
    tmp = fb + FB_SIZE/2;
    for (n=0; n<1366; n++) {
        *tmp++ = 255;
    }

    // Vertical line
    tmp = fb + 1366/2;
    for (n=0; n<768; n++) {
        *tmp = 255;
        tmp += Span;
    }

    // Draw blue square
    // Hrozontal top line
    tmp = fb + FB_SIZE/2 - Span*100 + 1366/2 -100;
    for (n=0; n<200; n++) {
        *tmp++ = 3;
    }

    // Hrozontal bottom line
    tmp = fb + FB_SIZE/2 + Span*100 + 1366/2 -100;
    for (n=0; n<200; n++) {
        *tmp++ = 3;
    }

    // Vertical left line
    tmp = fb + FB_SIZE/2 - Span*100 + 1366/2 -100;
    for (n=0; n<200; n++) {
        *tmp = 3;
        tmp += Span;
    }

    // Vertical right line
    tmp = fb + FB_SIZE/2 - Span*100 + 1366/2 +100;
    for (n=0; n<200; n++) {
        *tmp = 3;
        tmp += Span;
    }

    // Draw green square
    // Hrozontal top line
    tmp = fb + FB_SIZE/2 - Span*200 + 1366/2 -200;
    for (n=0; n<400; n++) {
        *tmp++ = 0x1C;
    }

    // Hrozontal bottom line
    tmp = fb + FB_SIZE/2 + Span*200 + 1366/2 -200;
    for (n=0; n<400; n++) {
        *tmp++ = 0x1C;
    }

    // Vertical left line
    tmp = fb + FB_SIZE/2 - Span*200 + 1366/2 -200;
    for (n=0; n<400; n++) {
        *tmp = 0x1C;
        tmp += Span;
    }

    // Vertical right line
    tmp = fb + FB_SIZE/2 - Span*200 + 1366/2 +200;
    for (n=0; n<400; n++) {
        *tmp = 0x1C;
        tmp += Span;
    }

    // Draw green square
    // Hrozontal t line
    tmp = fb + FB_SIZE/2 - Span*300 + 1366/2 -300;
    for (n=0; n<600; n++) {
        *tmp++ = 0xE0;
    }

    // Hrozontal bottom line
    tmp = fb + FB_SIZE/2 + Span*300 + 1366/2 -300;
    for (n=0; n<600; n++) {
        *tmp++ = 0xE0;
    }

    // Vertical left line
    tmp = fb + FB_SIZE/2 - Span*300 + 1366/2 -300;
    for (n=0; n<600; n++) {
        *tmp = 0xE0;
        tmp += Span;
    }

    // Vertical right line
    tmp = fb + FB_SIZE/2 - Span*300 + 1366/2 +300;
    for (n=0; n<600; n++) {
        *tmp = 0xE0;
        tmp += Span;
    }
#endif

//    copyFunction();
    //    codeInRam();
    BootLoadM4();

#if 0
    n = 0;

    /* Test communication nrf24l01p */
    powerDown24();

    stackOverflow();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
    mainLoop();
#endif
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 168;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief CRC Initialization Function
  * @param None
  * @retval None
  */
static void MX_CRC_Init(void)
{

  /* USER CODE BEGIN CRC_Init 0 */

  /* USER CODE END CRC_Init 0 */

  /* USER CODE BEGIN CRC_Init 1 */

  /* USER CODE END CRC_Init 1 */
  hcrc.Instance = CRC;
  if (HAL_CRC_Init(&hcrc) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN CRC_Init 2 */

  /* USER CODE END CRC_Init 2 */

}

/**
  * @brief LTDC Initialization Function
  * @param None
  * @retval None
  */
static void MX_LTDC_Init(void)
{

  /* USER CODE BEGIN LTDC_Init 0 */

  /* USER CODE END LTDC_Init 0 */

  LTDC_LayerCfgTypeDef pLayerCfg = {0};

  /* USER CODE BEGIN LTDC_Init 1 */

  /* USER CODE END LTDC_Init 1 */
  hltdc.Instance = LTDC;
  hltdc.Init.HSPolarity = LTDC_HSPOLARITY_AH;
  hltdc.Init.VSPolarity = LTDC_VSPOLARITY_AH;
  hltdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;
  hltdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
  hltdc.Init.HorizontalSync = 143;
  hltdc.Init.VerticalSync = 3;
  hltdc.Init.AccumulatedHBP = 356;
  hltdc.Init.AccumulatedVBP = 27;
  hltdc.Init.AccumulatedActiveW = 1722;
  hltdc.Init.AccumulatedActiveH = 795;
  hltdc.Init.TotalWidth = 1792;
  hltdc.Init.TotalHeigh = 798;
  hltdc.Init.Backcolor.Blue = 0;
  hltdc.Init.Backcolor.Green = 0;
  hltdc.Init.Backcolor.Red = 0;
  if (HAL_LTDC_Init(&hltdc) != HAL_OK)
  {
    Error_Handler();
  }
  pLayerCfg.WindowX0 = 0;
  pLayerCfg.WindowX1 = 1366;
  pLayerCfg.WindowY0 = 0;
  pLayerCfg.WindowY1 = 768;
  pLayerCfg.PixelFormat = LTDC_PIXEL_FORMAT_L8;
  pLayerCfg.Alpha = 255;
  pLayerCfg.Alpha0 = 0;
  pLayerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
  pLayerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
  pLayerCfg.FBStartAdress = 0xD0000000;
  pLayerCfg.ImageWidth = 1366;
  pLayerCfg.ImageHeight = 768;
  pLayerCfg.Backcolor.Blue = 0;
  pLayerCfg.Backcolor.Green = 0;
  pLayerCfg.Backcolor.Red = 0;
  if (HAL_LTDC_ConfigLayer(&hltdc, &pLayerCfg, 0) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN LTDC_Init 2 */
  /* Sets the Layer1 (index 0 refers to Layer1) Pitch to Span pixels to be a pmultple of 4 */
  HAL_LTDC_SetPitch(&hltdc, Span, 0);
  /* Install and enable CLUT */
  if (HAL_LTDC_ConfigCLUT(&hltdc, (uint32_t *) clut, 256, 0))
  {
    Error_Handler();
  }

