ef15c/oberon_stm32f4/stm429_oberon_station/Core/Src/main.c
  HAL_NVIC_SetPriority(EXTI4_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI4_IRQn);

  HAL_NVIC_SetPriority(EXTI9_5_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);

  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/**
  * @brief GPIO Open drain default high
  * @param None
  * @retval None
  */
void PS2_PINS_Output_OD_High(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(PS2_CLOCK_1_GPIO_Port, PS2_CLOCK_1_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(PS2_DATA_1_GPIO_Port, PS2_DATA_1_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(PS2_CLOCK_2_GPIO_Port, PS2_CLOCK_2_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(PS2_DATA_2_GPIO_Port, PS2_DATA_2_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin : PS2_CLOCK_1_Pin, PS2_DATA_1_Pin, PS2_CLOCK_2_Pin, PS2_DATA_2_Pin */
  GPIO_InitStruct.Pin = PS2_CLOCK_1_Pin | PS2_DATA_1_Pin | PS2_CLOCK_2_Pin | PS2_DATA_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(PS2_CLOCK_1_GPIO_Port, &GPIO_InitStruct);
}


/**
  * @brief Initialize PS/2 handlers for the board
  * @param None
  * @retval None
  */
static void BSP_PS2_Init(void)
{
    /* Wait for completion of PS/2 devices self tests */
    HAL_Delay(500);

    /* Probe PS/2 devices */
    ps2_1.clockPort = PS2_CLOCK_1_GPIO_Port;
    ps2_1.clockPin = PS2_CLOCK_1_Pin;
    ps2_1.dataPort = PS2_DATA_1_GPIO_Port;
    ps2_1.dataPin = PS2_DATA_1_Pin;
    ps2_1.KBLedPort = LD3_GPIO_Port;
    ps2_1.KBLedPin = LD3_Pin;
    ps2_1.MouseLedPort = LD4_GPIO_Port;
    ps2_1.MouseLedPin = LD4_Pin;
    ps2_1.answerBlock = &mskbBlock;
    PS2_initHandle(&ps2_1);

    ps2_2.clockPort = PS2_CLOCK_2_GPIO_Port;
    ps2_2.clockPin = PS2_CLOCK_2_Pin;
    ps2_2.dataPort = PS2_DATA_2_GPIO_Port;
    ps2_2.dataPin = PS2_DATA_2_Pin;
    ps2_2.KBLedPort = LD3_GPIO_Port;
    ps2_2.KBLedPin = LD3_Pin;
    ps2_2.MouseLedPort = LD4_GPIO_Port;
    ps2_2.MouseLedPin = LD4_Pin;
    ps2_2.answerBlock = &mskbBlock;
    PS2_initHandle(&ps2_2);
}


/**
  * @brief  EXTI line detection callbacks.
  * @param  GPIO_Pin: Specifies the pins connected EXTI line
  * @retval None
  */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch(GPIO_Pin) {
  case PS2_CLOCK_1_Pin:
    /* First PS/2 port */
    PS2_ProcessData(&ps2_1);
    break;
  case PS2_CLOCK_2_Pin:
    /* Second PS/2 port */
    PS2_ProcessData(&ps2_2);
    break;
  case PB1_Pin:
	/* Trigger pendSV interrupt for abort processing */
	SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;
	__ISB();
    break;
  }
}

void MPU_RegionConfig(void)
{
    MPU_Region_InitTypeDef MPU_InitStruct;
    /* Disable MPU */
    HAL_MPU_Disable();
    /* Configure SDRAM region as Region N°0, 4M of size and R/W region */
    MPU_InitStruct.Number = MPU_REGION_NUMBER0;
    MPU_InitStruct.Enable = MPU_REGION_ENABLE;
    MPU_InitStruct.BaseAddress = 0xD0201000;
    MPU_InitStruct.Size = MPU_REGION_SIZE_4MB;
    MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
    MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
    MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
    MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
    MPU_InitStruct.SubRegionDisable = 0x00;
    MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
    HAL_MPU_ConfigRegion(&MPU_InitStruct);
    /* Configure SDRAM region as REGION N°1, 4MB of size and R/W region */
    MPU_InitStruct.BaseAddress = 0xD0400000;
    MPU_InitStruct.Size = MPU_REGION_SIZE_4MB;
    MPU_InitStruct.Number = MPU_REGION_NUMBER1;
    HAL_MPU_ConfigRegion(&MPU_InitStruct);
    /* Enable MPU */
    HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

#if 0
/**
  * @brief  DMA conversion complete callback
  * @note   This function is executed when the transfer complete interrupt
  *         is generated
  * @retval None
  */
static void TransferComplete(DMA_HandleTypeDef *DmaHandle)
{
    if (DmaHandle != &hdma_memtomem_dma2_stream0) {
        return;
    }

    if (tranfSize>0) {
        int l;

        if (tranfSize>64000*4) {
            l = 64000*4;
        } else {
            l = tranfSize;
        }

        if(HAL_DMA_Start_IT(&hdma_memtomem_dma2_stream0, (uint32_t)&color, (uint32_t)dmaBuf, l/4) != HAL_OK)
        {
            Error_Handler();
        }

        tranfSize -= l;
        dmaBuf += l;
    } else {
        HAL_LTDC_Reload(&hltdc, LTDC_RELOAD_VERTICAL_BLANKING);
    }
}

/**
  * @brief  DMA conversion error callback
  * @note   This function is executed when the transfer error interrupt
  *         is generated during DMA transfer
  * @retval None
  */
static void TransferError(DMA_HandleTypeDef *DmaHandle)
{
  Error_Handler();
}

/**
  * @brief  Reload Event callback.
  * @param  hltdc  pointer to a LTDC_HandleTypeDef structure that contains
  *                the configuration information for the LTDC.
  * @retval None
  */
void HAL_LTDC_ReloadEventCallback(LTDC_HandleTypeDef *hltdc)
{
    uint8_t *tmp;

    /* Switch frame buffers */
    tmp = fb;
    fb = bb;
    bb = tmp;

    HAL_LTDC_SetAddress(hltdc, (uint32_t) fb, 0);
}

/* Commandes */
#define NOP24 0xFF
#define R_REGISTER24 0
#define W_REGISTER24 0x20
#define R_RX_PL_WID24 0x60
#define R_RX_PAYLOAD24 0x61
#define W_TX_PAYLOAD24 0xA0
#define FLUSH_TX24 0xE1
#define FLUSH_RX24 0xE2
#define W_ACK_PAYLOAD24 0xA8

/* Registres */
#define CONFIG24 0
#define EN_RXADDR24 0x02
#define SETUP_AW24 0x03
#define SETUP_RETR24 0x04
#define RF_CH24 0x05
#define RF_SETUP24 0x06
#define STATUS24 0x07
#define RX_ADDR_P024 0x0A
#define TX_ADDR24 0x10
#define RX_PW_P024 0x11
#define FIFO_STATUS24 0x17
#define DYNPD24 0x1C
#define FEATURE24 0x1D

void talk24(int sz, unsigned char *cmd, unsigned char *rep)
{

    if (cmd==0 || rep==0) {
        /* Trap wrong buffer pointers */
        while (1) {}
    }

	/* Sélection de la communication SPI avec le module */
	HAL_GPIO_WritePin(NRF24L01P_CS_GPIO_Port, NRF24L01P_CS_Pin, GPIO_PIN_RESET); // NRF_CS is going LOW

	HAL_Delay(1);
    HAL_SPI_TransmitReceive(&hspi3, cmd, rep, sz, HAL_MAX_DELAY);
	HAL_Delay(1);

	/* Libération de la communication SPI avec le module */
	HAL_GPIO_WritePin(NRF24L01P_CS_GPIO_Port, NRF24L01P_CS_Pin, GPIO_PIN_SET); // NRF_CS is going LOW
}

static void powerDown24(void)
{
    unsigned char cmd[33];
    unsigned char rep[33];

