ef15c/oberon_stm32f4/stm429_oberon_station/Core/Src/main.c
    /* Power down */
    cmd[1] = 0x0D;
    do {
        *cmd = W_REGISTER24+CONFIG24;
        talk24(2, cmd, rep);
        *cmd = R_REGISTER24+CONFIG24;
        talk24(2, cmd, rep);
    } while (rep[1] != cmd[1]);
}

static void stackOverflow(void)
{
    int a;

    UNUSED(a);

    /* Cause a stack overflow to test recovery code */
    stackOverflow();
}

void mainLoop(void)
{
#if 0
  volatile uint32_t ticks;
#endif
  uint32_t n=0;

  while (1)
  {
#ifdef VGA_DMA
    for (color=0; color<256; color++) {
        tranfSize = FB_SIZE;
        dmaBuf = bb;
        TransferComplete(&hdma_memtomem_dma2_stream0);

        HAL_Delay(1000);

        n++;
    }
#else
#if 0
    if (n >= 256) {
        n = 0;
    }

    if (tmp >= fb+FB_SIZE) {
        tmp = fb;
    }

    *tmp++ = n++;
    HAL_Delay(1);

    ticks = HAL_GetTick();
    codeInRam();
    ticks = HAL_GetTick() - ticks;
#endif
    if (n >= 256) {
        n = 0;
    }

    led(++n);
//    testTrap(n);

    HAL_Delay(1000);
#endif
  }
}
#endif
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
